In [1]:
%load_ext sql

In [2]:
%sql postgresql+psycopg://localhost:5432/intro_to_sql_for_analytics

In [3]:
%sql SELECT * FROM albums

 * postgresql+psycopg://localhost:5432/intro_to_sql_for_analytics
12 rows affected.

[(1, 'Doolittle', 1989, 1),
 (2, 'Surfer Rosa', 1988, 1),
 (3, 'Waterloo', 1974, 2),
 (4, 'Super Trouper', 1980, 2),
 (5, 'Bossanova', 1990, 1),
 (6, 'Lover', 2019, 3),
 (7, 'Folklore', 2020, 3),
 (8, 'I Put a Spell on You', 1965, 4),
 (9, 'Baltimore', 1978, 4),
 (10, 'Here Comes the Sun', 1971, 4),
 (11, 'Fodder on My Wings', 1982, 4),
 (12, 'Ring Ring', 1973, 2)]

In [4]:
%sql SELECT id, title FROM albums;

 * postgresql+psycopg://localhost:5432/intro_to_sql_for_analytics
12 rows affected.

[(1, 'Doolittle'),
 (2, 'Surfer Rosa'),
 (3, 'Waterloo'),
 (4, 'Super Trouper'),
 (5, 'Bossanova'),
 (6, 'Lover'),
 (7, 'Folklore'),
 (8, 'I Put a Spell on You'),
 (9, 'Baltimore'),
 (10, 'Here Comes the Sun'),
 (11, 'Fodder on My Wings'),
 (12, 'Ring Ring')]

In [9]:
%%sql 

-- From albums,
-- filter where id is '2',
-- and select only values for the columns id, title and release_year.
SELECT id, title, release_year
  FROM albums
  WHERE id = 2;

-- From albums,
-- filter where title is 'Doolittle',
-- and select only values for the columns id, title and release_year.

-- Make sure to always use single quotes ('')
-- to delimitate strings in conditions.
SELECT id, title, release_year
  FROM albums
  WHERE title = 'Doolittle';

-- We can use =, <, <=, >, >=
-- to compare values.

-- From albums,
-- filter where release_year is greater than 1990,
-- and select only values for the columns id, title and release_year.
SELECT id, title, release_year
  FROM albums
  WHERE release_year > 1990;

-- We can use the keywords AND and OR
-- to combine conditions.

-- From albums,
-- filter where release_year is greater than 1990 AND artist_is is '1',
-- and select only values for the columns id, title, release_year and artist_id.
SELECT id, title, release_year, artist_id
  FROM albums
  WHERE release_year > 1989 AND artist_id = 1;

 * postgresql+psycopg://localhost:5432/intro_to_sql_for_analytics
1 rows affected.
1 rows affected.
2 rows affected.
1 rows affected.

[(5, 'Bossanova', 1990, 1)]

In [10]:
%%sql

SELECT release_year FROM albums;

 * postgresql+psycopg://localhost:5432/intro_to_sql_for_analytics
12 rows affected.

[(1989,),
 (1988,),
 (1974,),
 (1980,),
 (1990,),
 (2019,),
 (2020,),
 (1965,),
 (1978,),
 (1971,),
 (1982,),
 (1973,)]

In [11]:
%%sql

SELECT release_year
FROM albums
WHERE title='Bossanova'

 * postgresql+psycopg://localhost:5432/intro_to_sql_for_analytics
1 rows affected.

[(1990,)]

In [20]:
%%sql

SELECT title
FROM albums
JOIN artists
ON albums.artist_id = artists.id
WHERE artists.name = 'Pixies'

 * postgresql+psycopg://localhost:5432/intro_to_sql_for_analytics
3 rows affected.

[('Doolittle',), ('Surfer Rosa',), ('Bossanova',)]